Autodesk.Navisworks.Api.Vector2D
Represents a direction with magnitude in 2D space. Immutable.

Autodesk.Navisworks.Api.Vector2D.#ctor
Create a zero vector
Throws System.InvalidOperationException:
Exception when 'false'

Autodesk.Navisworks.Api.Vector2D.#ctor(System.Double,System.Double)
Create a vector from X and Y components

Autodesk.Navisworks.Api.Vector2D.Add(Autodesk.Navisworks.Api.Point2D)
Translates a point by this vector and returns the resulting point

Autodesk.Navisworks.Api.Vector2D.Add(Autodesk.Navisworks.Api.Vector2D)
Adds another vector to this to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.Add(System.Double)
Adds a value to every X, Y and Z coordinate in the Vector and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Angle(Autodesk.Navisworks.Api.Vector2D)
Returns the angle between this vector and another vector in the range [0, PI]
vector: Vector to calculate angle with.
Returns: Angle in radians between this and vector.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.AngleWithReference(Autodesk.Navisworks.Api.Vector2D,Autodesk.Navisworks.Api.Vector2D)
Returns the angle between this vector and another vector in the range [-PI, PI], using a reference vector to determine the sign of the angle
vector: Vector to calculate angle with.
reference: Reference vector pointing away from the plane containing this and vector.
Returns: Angle in radians between this and vector.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed
Throws System.ArgumentNullException:
Argument 'reference' is null
Throws System.ArgumentException:
Argument 'reference' has been Disposed

Autodesk.Navisworks.Api.Vector2D.Cross(Autodesk.Navisworks.Api.Vector2D)
Returns the cross product between this vector and another
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.DirectionEquals(Autodesk.Navisworks.Api.Vector2D)
Compare direction of vectors using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.DirectionEquals(Autodesk.Navisworks.Api.Vector2D,System.Double)
Compare direction of vectors using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.Divide(Autodesk.Navisworks.Api.Vector2D)
Divides this vector by another to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.Divide(System.Double)
Divides every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Dot(Autodesk.Navisworks.Api.Vector2D)
Returns the dot product between this vector and another
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Vector2D.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Vector2D.Invert
Returns an inverted version of this vector (all components inverted)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Vector2D.IsZero
Is this a zero vector (all components are zero) ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Item(System.Int32)


Autodesk.Navisworks.Api.Vector2D.Length
Magnitude of vector
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.LengthSquared
Magnitude of vector squared
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Multiply(Autodesk.Navisworks.Api.Vector2D)
Multiplies a vector by this to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.Multiply(System.Double)
Multiplies every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Negate
Returns a negated version of this vector (all components negated)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Normalize
Returns a normalized version of this vector (magnitude of 1)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.op_Addition(Autodesk.Navisworks.Api.Vector2D,Autodesk.Navisworks.Api.Vector2D)
Adds two vectors to produce a new vector

Autodesk.Navisworks.Api.Vector2D.op_Addition(Autodesk.Navisworks.Api.Vector2D,System.Double)
Adds a value to every X, Y and Z coordinate in the Vector and returns a new Vector with the result

Autodesk.Navisworks.Api.Vector2D.op_Addition(System.Double,Autodesk.Navisworks.Api.Vector2D)
Adds a value to every X, Y and Z coordinate in the Vector and returns a new Vector with the result

Autodesk.Navisworks.Api.Vector2D.op_Division(Autodesk.Navisworks.Api.Vector2D,Autodesk.Navisworks.Api.Vector2D)
Divides two vectors to produce a new vector

Autodesk.Navisworks.Api.Vector2D.op_Division(Autodesk.Navisworks.Api.Vector2D,System.Double)
Divides every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result

Autodesk.Navisworks.Api.Vector2D.op_Multiply(Autodesk.Navisworks.Api.Vector2D,Autodesk.Navisworks.Api.Vector2D)
Multiplies two vectors to produce a new vector

Autodesk.Navisworks.Api.Vector2D.op_Multiply(Autodesk.Navisworks.Api.Vector2D,System.Double)
Multiplies every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result

Autodesk.Navisworks.Api.Vector2D.op_Multiply(System.Double,Autodesk.Navisworks.Api.Vector2D)
Multiplies every X, Y and Z coordinate in the Vector by a value and returns a new Vector with the result

Autodesk.Navisworks.Api.Vector2D.op_Subtraction(Autodesk.Navisworks.Api.Vector2D,Autodesk.Navisworks.Api.Vector2D)
Subtracts two vectors to produce a new vector

Autodesk.Navisworks.Api.Vector2D.op_Subtraction(Autodesk.Navisworks.Api.Vector2D,System.Double)
Subtracts a value from every X, Y and Z coordinate in the Vector and returns a new Vector with the result

Autodesk.Navisworks.Api.Vector2D.Subtract(Autodesk.Navisworks.Api.Vector2D)
Subtracts a vector from this to produce a new vector
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.Subtract(System.Double)
Subtracts a value from every X, Y and Z coordinate in the Vector and returns a new Vector with the result
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.TolerantEquals(Autodesk.Navisworks.Api.Vector2D)
Compare vectors using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.TolerantEquals(Autodesk.Navisworks.Api.Vector2D,Autodesk.Navisworks.Api.Vector2D)
Compare vectors using a tolerance
Throws System.ArgumentNullException:
Argument 'vector0' is null
Throws System.ArgumentException:
Argument 'vector0' has been Disposed
Throws System.ArgumentNullException:
Argument 'vector1' is null
Throws System.ArgumentException:
Argument 'vector1' has been Disposed

Autodesk.Navisworks.Api.Vector2D.TolerantEquals(Autodesk.Navisworks.Api.Vector2D,Autodesk.Navisworks.Api.Vector2D,System.Double)
Compare vectors using a tolerance
Throws System.ArgumentNullException:
Argument 'vector0' is null
Throws System.ArgumentException:
Argument 'vector0' has been Disposed
Throws System.ArgumentNullException:
Argument 'vector1' is null
Throws System.ArgumentException:
Argument 'vector1' has been Disposed

Autodesk.Navisworks.Api.Vector2D.TolerantEquals(Autodesk.Navisworks.Api.Vector2D,System.Double)
Compare vectors using a tolerance
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'vector' is null
Throws System.ArgumentException:
Argument 'vector' has been Disposed

Autodesk.Navisworks.Api.Vector2D.ToPoint2D
Convert vector to a point (equivalent to point from adding vector to origin)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Vector2D.UnitX
Returns a unit vector in the X direction (1,0)

Autodesk.Navisworks.Api.Vector2D.UnitY
Returns a unit vector in the Y direction (0,1)

Autodesk.Navisworks.Api.Vector2D.X
Returns the X component of the vector
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Y
Returns the Y component of the vector
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Vector2D.Zero
Returns a zero vector (0,0)